app/views/profiles/show.html.erb


<% if @profile.photos.first %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."profile_id" = ? ORDER BY "photos"."id" ASC LIMIT 1  [["profile_id", 5]]

    <% end %>
  <% if @profile.photos.count > 1 %>
---
SELECT COUNT(*) FROM "photos" WHERE "photos"."profile_id" = ?  [["profile_id", 5]]