app/views/conversations/index.html.erb

SELECT "conversations".* FROM "conversations" WHERE (initiator = 3)
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? ORDER BY "profiles"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "interactions" ON "users"."id" = "interactions"."user_id" WHERE "interactions"."conversation_id" = ? ORDER BY "users"."id" DESC LIMIT 1  [["conversation_id", 9]]
---
	<p>
	<%= link_to "Conversation", conversation_path(chat) %> between <%= chat.users.first.profile.first_name %> and <%= chat.users.last.profile.first_name %>