app/views/conversations/show.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = ? ORDER BY "messages"."id" ASC LIMIT 1  [["conversation_id", 11]]
---

<% if !@converse.messages.first %>

SELECT "photos".* FROM "photos" WHERE "photos"."profile_id" = ? ORDER BY "photos"."id" ASC LIMIT 1  [["profile_id", 5]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? ORDER BY "profiles"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
	<p>
		<% if mess.user.profile.photos.first.avatar %>