app/controllers/conversations_controller.rb

  def index
    @mycons = current_user.conversations.all #.uniq!
---
SELECT "conversations".* FROM "conversations" INNER JOIN "interactions" ON "conversations"."id" = "interactions"."conversation_id" WHERE "interactions"."user_id" = ?  [["user_id", 1]]

  def create
    @profile = Profile.find(params[:id])

    if current_user.conversations.last && DateTime.now - 1.day > current_user.conversations.last.created_at
      redirect_to profile_path(@profile)
    end

    @converse = Conversation.new()
    @converse.initiator = current_user.id
    @converse.mark = @profile.user_id
    @converse.save

    Interaction.create(:conversation_id => @converse.id, :user_id => current_user.id)
    Interaction.create(:conversation_id => @converse.id, :user_id => @profile.user_id)

=begin
    @message = Message.new
    @message.conversation_id = @converse.id
    @message.user_id = @profile.user_id
    @message.save
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "5"]]
INSERT INTO "conversations" ("created_at", "initiator", "mark", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 12 Jun 2014 22:21:37 UTC +00:00], ["initiator", 1], ["mark", 3], ["updated_at", Thu, 12 Jun 2014 22:21:37 UTC +00:00]]
SELECT "conversations".* FROM "conversations" INNER JOIN "interactions" ON "conversations"."id" = "interactions"."conversation_id" WHERE "interactions"."user_id" = ? ORDER BY "conversations"."id" DESC LIMIT 1  [["user_id", 1]]
INSERT INTO "interactions" ("conversation_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["conversation_id", 9], ["created_at", Sat, 14 Jun 2014 01:38:10 UTC +00:00], ["updated_at", Sat, 14 Jun 2014 01:38:10 UTC +00:00], ["user_id", 1]]
INSERT INTO "messages" ("conversation_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["conversation_id", 2], ["created_at", Wed, 04 Jun 2014 01:17:54 UTC +00:00], ["updated_at", Wed, 04 Jun 2014 01:17:54 UTC +00:00], ["user_id", 1]]

  def destroy
    @converse = Conversation.find(params[:id])
    @converse.destroy
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "conversations" WHERE "conversations"."id" = ?  [["id", 2]]

  def show
    @converse = Conversation.find(params[:id])
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT 1  [["id", "2"]]