app/controllers/conversations_controller.rb

  def index
    @mycons = current_user.conversations.all.uniq!
---
SELECT DISTINCT id FROM "conversations" INNER JOIN "messages" ON "conversations"."id" = "messages"."conversation_id" WHERE "messages"."user_id" = ?  [["user_id", 3]]