app/controllers/favorites_controller.rb

    def create
    	@favorite = Favorite.new()
    	@profile = Profile.find(params[:id])

    	#From here out Profile references should be user references, debugging...
    	# @star = User.find(@profile.user_id)
    	@star = @profile.id

      @favorite.user_id = current_user.id
    	@favorite.star_id = @star

      @favorite.save
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "favorites" ("created_at", "star_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sun, 01 Jun 2014 07:12:14 UTC +00:00], ["star_id", 4], ["updated_at", Sun, 01 Jun 2014 07:12:14 UTC +00:00], ["user_id", 1]]

    def destroy
      @favorite = current_user.favorites.find(params[:id])
      @favorite.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 1], ["id", "1"]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]

    def index
      @favs = []
      current_user.favorites.each do |fav|
        @favs << Profile.find(fav.star_id)
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? ORDER BY "favorites"."created_at" DESC  [["user_id", 1]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 4]]