app/controllers/messages_controller.rb

SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "messages" ("conversation_id", "created_at", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["conversation_id", 3], ["created_at", Wed, 04 Jun 2014 01:45:39 UTC +00:00], ["text", "Hey, trying out the messages"], ["updated_at", Wed, 04 Jun 2014 01:45:39 UTC +00:00], ["user_id", 3]]
---
  def create
    @conversation = Conversation.find(params[:conversation_id])
    @message = @conversation.messages.new(params[:message].permit(:text))
    @message.user_id = current_user.id
    @message.save