app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @photo = Photo.find(params[:id])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "photos" SET "caption" = ?, "avatar" = ?, "updated_at" = ? WHERE "photos"."id" = 2  [["caption", "Parchment with burnt edge"], ["avatar", "246umvc.jpg"], ["updated_at", Fri, 13 Jun 2014 03:33:31 UTC +00:00]]
---
  def update
    @photo = Photo.find(params[:id])
    @profile = current_user.profile

    if @photo.update(photo_params)

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "5"]]
INSERT INTO "photos" ("avatar", "caption", "created_at", "profile_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["avatar", "246umvc.jpg"], ["caption", ""], ["created_at", Fri, 13 Jun 2014 03:08:35 UTC +00:00], ["profile_id", 5], ["updated_at", Fri, 13 Jun 2014 03:08:35 UTC +00:00]]
---
  def create
  	@photo = Photo.new(photo_params)
  	@profile = Profile.find(params[:profile_id])

    @photo.profile_id = @profile.id

    @photo.save

SELECT "photos".* FROM "photos" WHERE "photos"."profile_id" = ? AND "photos"."id" = ? LIMIT 1  [["profile_id", 5], ["id", "1"]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? ORDER BY "profiles"."id" ASC LIMIT 1  [["user_id", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 1]]
---
  def destroy
    @photo = current_user.profile.photos.find(params[:id])
    @photo.destroy