app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("bio", "birthday", "created_at", "first_name", "gender", "height", "kids", "pets", "rank", "subscribed", "updated_at", "user_id", "weight", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def create
  @profile = Profile.new(profile_params)
  cords = Geocoder.coordinates(@profile.zipcode.to_s)
	@profile.latitude = cords.first
	@profile.longitude = cords.last
  @profile.user_id = current_user.id
  @profile.rank = 0
  @profile.subscribed = false

  if @profile.save

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."star_id" = 4 LIMIT 1  [["user_id", 1]]
SELECT "conversations".* FROM "conversations" INNER JOIN "interactions" ON "conversations"."id" = "interactions"."conversation_id" WHERE "interactions"."user_id" = ?  [["user_id", 1]]
---
def show
  @profile = Profile.find(params[:id])
  @fav = current_user.favorites.find_by star_id: @profile.id
  @con = nil
  current_user.conversations.each do |convo|

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "profiles" SET "zipcode" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "profiles"."id" = 5  [["zipcode", "02465"], ["latitude", 42.3469147], ["longitude", -71.2220832], ["updated_at", Tue, 10 Jun 2014 17:38:35 UTC +00:00]]
---
def update
	@profile = Profile.find(params[:id])

	cords = Geocoder.coordinates(@profile.zipcode.to_s)
	@profile.latitude = cords.first
	@profile.longitude = cords.last

	if @profile.update(profile_params)