app/controllers/searches_controller.rb

SELECT profiles.*, (69.09332411348201 * ABS(profiles.latitude - 33.3897576) * 0.7071067811865475) + (59.836573914187355 * ABS(profiles.longitude - -111.9343636) * 0.7071067811865475) AS distance, CASE WHEN (profiles.latitude >= 33.3897576 AND profiles.longitude >= -111.9343636) THEN 45.0 WHEN (profiles.latitude < 33.3897576 AND profiles.longitude >= -111.9343636) THEN 135.0 WHEN (profiles.latitude < 33.3897576 AND profiles.longitude < -111.9343636) THEN 225.0 WHEN (profiles.latitude >= 33.3897576 AND profiles.longitude < -111.9343636) THEN 315.0 END AS bearing FROM "profiles" WHERE "profiles"."single" = 't' AND ("profiles"."height" BETWEEN 60 AND 68) AND ("profiles"."weight" BETWEEN 90 AND 205) AND (profiles.latitude BETWEEN 33.31739170844458 AND 33.462123491555424 AND profiles.longitude BETWEEN -112.02103491692478 AND -111.84769228307522) ORDER BY distance ASC
---
  def show
    @search = current_user.search

    h = (@search.minheight..@search.maxheight)
    w = (@search.minweight..@search.maxweight)
    a = (@search.minage..@search.maxage)
    t = true
    @pets = []
    @kids = []
    @ages = []
    today = Date.today
    @orient = []
    @dist = []
    @myage = today.year - current_user.profile.birthday.year

    # SQL filter by height and weight
    @profiles = Profile.where(:single => true, :height => h, :weight => w)