app/controllers/searches_controller.rb

INSERT INTO "searches" ("created_at", "gender", "kids", "pets", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 05 Jun 2014 00:41:38 UTC +00:00], ["gender", "female"], ["kids", false], ["pets", true], ["updated_at", Thu, 05 Jun 2014 00:41:38 UTC +00:00], ["user_id", 1]]
---
  def create
    @search = Search.new(search_params)
    @search.user_id = current_user.id
    if @search.save

SELECT "searches".* FROM "searches" WHERE "searches"."user_id" = ? ORDER BY "searches"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT profiles.*, (69.09332411348201 * ABS(profiles.latitude - 33.4366655) * 0.7071067811865475) + (59.836573914187355 * ABS(profiles.longitude - -111.9403254) * 0.7071067811865475) AS distance, CASE WHEN (profiles.latitude >= 33.4366655 AND profiles.longitude >= -111.9403254) THEN 45.0 WHEN (profiles.latitude < 33.4366655 AND profiles.longitude >= -111.9403254) THEN 135.0 WHEN (profiles.latitude < 33.4366655 AND profiles.longitude < -111.9403254) THEN 225.0 WHEN (profiles.latitude >= 33.4366655 AND profiles.longitude < -111.9403254) THEN 315.0 END AS bearing FROM "profiles" WHERE ("profiles"."height" BETWEEN 60 AND 68) AND ("profiles"."weight" BETWEEN 90 AND 205) AND (profiles.latitude BETWEEN 33.1472019337783 AND 33.726129066221695 AND profiles.longitude BETWEEN -112.28719796380092 AND -111.59345283619909) ORDER BY distance ASC
SELECT profiles.*, (69.09332411348201 * ABS(profiles.latitude - 33.4366655) * 0.7071067811865475) + (59.836573914187355 * ABS(profiles.longitude - -111.9403254) * 0.7071067811865475) AS distance, CASE WHEN (profiles.latitude >= 33.4366655 AND profiles.longitude >= -111.9403254) THEN 45.0 WHEN (profiles.latitude < 33.4366655 AND profiles.longitude >= -111.9403254) THEN 135.0 WHEN (profiles.latitude < 33.4366655 AND profiles.longitude < -111.9403254) THEN 225.0 WHEN (profiles.latitude >= 33.4366655 AND profiles.longitude < -111.9403254) THEN 315.0 END AS bearing FROM "profiles" WHERE (profiles.latitude BETWEEN 33.1472019337783 AND 33.726129066221695 AND profiles.longitude BETWEEN -112.28719796380092 AND -111.59345283619909 AND profiles.id != 5) ORDER BY distance ASC
---
  def show
    @search = current_user.search

    h = (@search.minheight..@search.maxheight)
    w = (@search.minweight..@search.maxweight)
    a = (@search.minage..@search.maxage)
    @pets = []
    @kids = []
    @ages = []
    today = Date.today
    @orient = []
    @dist = []

    # SQL filter by height and weight
    @profiles = Profile.where(:height => h, :weight => w)

    # Filter by distance...
    @profiles.each do |p|

SELECT "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @search = Search.find(params[:id])

SELECT "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "searches" SET "distance" = ?, "minheight" = ?, "minweight" = ?, "minage" = ?, "maxheight" = ?, "maxweight" = ?, "maxage" = ?, "updated_at" = ? WHERE "searches"."id" = 1  [["distance", 20], ["minheight", 48], ["minweight", 90], ["minage", 18], ["maxheight", 84], ["maxweight", 300], ["maxage", 70], ["updated_at", Thu, 05 Jun 2014 00:54:39 UTC +00:00]]
---
  def update
    @search = Search.find(params[:id])
    # @search = current_user.search
  	if @search.update(search_params)